---
type: SpatialElementFromToCalculationPoints
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# SpatialElementFromToCalculationPoints

`Autodesk.Revit.DB.SpatialElementFromToCalculationPoints` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Flip | 2014 | `public void Flip ()` |
| Method | IsAcceptableFromPosition | 2014 | `public bool IsAcceptableFromPosition ( XYZ fromPosition )` |
| Method | IsAcceptableToPosition | 2014 | `public bool IsAcceptableToPosition ( XYZ toPosition )` |
| Method | MakeFromPositionAcceptable | 2014 | `public XYZ MakeFromPositionAcceptable ( XYZ newFromLocation )` |
| Method | MakeToPositionAcceptable | 2014 | `public XYZ MakeToPositionAcceptable ( XYZ newToLocation )` |
| Property | FromPosition | 2014 | `public XYZ FromPosition { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | ToPosition | 2014 | `public XYZ ToPosition { get ; set ; }` |